In [1]:
#Dependencies
import pandas as pd
import numpy as np

In [2]:
#Import CSV File
nr_2016_sta_path = "Input_Data/Nice_Ride_2016_station_locations.csv"
nr_2016_trip_path = "Input_Data/Nice_ride_trip_history_2016_season.csv"

In [3]:
#Read data to df
station_16 = pd.read_csv(nr_2016_sta_path, dtype={"Terminal":str, "Station":str, "Latitude":float, "Longitude":float, "NbDocks":int, "Notes":str})
station_16.head()

,Terminal,Station,Latitude,Longitude,Nb Docks,Unnamed: 5
0,30000,100 Main Street SE,44.984892,-93.256551,27,NaN
1,30039,10th Street & Nicollet Mall,44.973839,-93.274544,11,NaN
2,30117,10th Street E & Cedar Street,44.950189,-93.097590,15,NaN
3,30154,11th Ave S & S 2nd Street,44.976730,-93.252189,23,NaN
4,30004,11th Street & Hennepin,44.975340,-93.278690,23,NaN

In [4]:
len(station_16)

202

In [5]:
station_16 = station_16.drop(columns=["Nb Docks", "Unnamed: 5"])
station_16 = station_16.sort_values(by=["Terminal"], ignore_index=True)
station_16

    Terminal                         Station   Latitude  Longitude
0      30000              100 Main Street SE  44.984892 -93.256551
1      30001        25th Street & 33rd Ave S  44.957341 -93.223374
2      30002      Riverside Ave & 23rd Ave S  44.967115 -93.240149
3      30003  Plymouth Ave N &  N Oliver Ave  44.991412 -93.306269
4      30004          11th Street & Hennepin  44.975340 -93.278690
..       ...                             ...        ...        ...
197    30195                     Willey Hall  44.972404 -93.242891
198    30196               Civil Engineering  44.976096 -93.231958
199    30197     15th Ave SE & 4th Street SE  44.979878 -93.234739
200    30198                  Bohemian Flats  44.976223 -93.241600
201    NRHQ     Nice Ride World Headquarters  44.953566 -93.220066

[202 rows x 4 columns]

In [6]:
station_16.rename(columns={"Terminal" : "station_id", 
                           "Station" : "station_name", 
                           "Latitude" : "station_lat", 
                           "Longitude" : "station_lng"}, 
                  inplace=True)
station_16.head()

  station_id                    station_name  station_lat  station_lng
0      30000              100 Main Street SE    44.984892   -93.256551
1      30001        25th Street & 33rd Ave S    44.957341   -93.223374
2      30002      Riverside Ave & 23rd Ave S    44.967115   -93.240149
3      30003  Plymouth Ave N &  N Oliver Ave    44.991412   -93.306269
4      30004          11th Street & Hennepin    44.975340   -93.278690

In [7]:
# Export .csv
station_16.to_csv(path_or_buf="Resources/Nice_ride_2016_station_locations.csv", index=False)

In [8]:
trip_16 = pd.read_csv(nr_2016_trip_path, dtype={"Start date":str, "Start station":str, "Start station number":str, "End date":str, "End station":str, "End station number":str, "Total duration (Seconds)":int, "Account type":str})
trip_16.head()

,Start date,Start station,Start station number,End date,End station,End station number,Total duration (seconds),Account type
0,11/6/2016 22:09,Willey Hall,30195,11/6/2016 22:14,McNamara Center,30057,325,Casual
1,11/6/2016 21:53,Sanford Hall,30182,11/6/2016 21:59,McNamara Center,30057,315,Member
2,11/6/2016 21:52,11th Ave S & S 2nd Street,30154,11/6/2016 22:17,Malcolm Ave SE & 5th Street SE,30055,1504,Casual
3,11/6/2016 21:52,11th Ave S & S 2nd Street,30154,11/6/2016 22:17,Malcolm Ave SE & 5th Street SE,30055,1496,Casual
4,11/6/2016 21:52,11th Ave S & S 2nd Street,30154,11/6/2016 22:17,Malcolm Ave SE & 5th Street SE,30055,1506,Casual

In [9]:
len(trip_16)

1048575

In [10]:
trip_16["Start date"] = pd.to_datetime(trip_16["Start date"])
trip_16["End date"] = pd.to_datetime(trip_16["End date"])

In [11]:
trip_16.rename(columns={"Start date" : "start_datetime", 
                        "Start station" : "start_station_name", 
                        "Start station number" : "start_station_id",
                        "End date" : "end_datetime",
                        "End station" : "end_station_name",
                        "End station number" : "end_station_id",
                        "Total duration (seconds)" : "total_duration_sec",
                        "Account type" : "account_type"}, 
              inplace=True)

In [12]:
trip_16.head()

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,total_duration_sec,account_type
0,2016-11-06 22:09:00,Willey Hall,30195,2016-11-06 22:14:00,McNamara Center,30057,325,Casual
1,2016-11-06 21:53:00,Sanford Hall,30182,2016-11-06 21:59:00,McNamara Center,30057,315,Member
2,2016-11-06 21:52:00,11th Ave S & S 2nd Street,30154,2016-11-06 22:17:00,Malcolm Ave SE & 5th Street SE,30055,1504,Casual
3,2016-11-06 21:52:00,11th Ave S & S 2nd Street,30154,2016-11-06 22:17:00,Malcolm Ave SE & 5th Street SE,30055,1496,Casual
4,2016-11-06 21:52:00,11th Ave S & S 2nd Street,30154,2016-11-06 22:17:00,Malcolm Ave SE & 5th Street SE,30055,1506,Casual

In [13]:
# Re-sort by datetime
trip_16 = trip_16.sort_values(["start_datetime"], ignore_index=True)
trip_16

,start_datetime,start_station_name,start_station_id,end_datetime,end_station_name,end_station_id,total_duration_sec,account_type
0,2016-04-04 08:50:00,Midtown Exchange,30008,2016-04-04 08:52:00,Midtown Exchange,30008,84,Member
1,2016-04-04 09:35:00,Washington & Marquette,30028,2016-04-04 09:51:00,Social Sciences,30019,952,Member
2,2016-04-04 10:12:00,West 15th Street & Willow,30093,2016-04-04 10:14:00,West 15th Street & Willow,30093,104,Member
3,2016-04-04 10:14:00,West 15th Street & Willow,30093,2016-04-04 10:19:00,11th Street & Hennepin,30004,292,Member
4,2016-04-04 10:19:00,Washington & Marquette,30028,2016-04-04 10:33:00,Elliot Hall,30058,870,Member
...,...,...,...,...,...,...,...,...
1048570,NaT,NaN,NaN,NaT,NaN,NaN,0,NaN
1048571,NaT,NaN,NaN,NaT,NaN,NaN,0,NaN
1048572,NaT,NaN,NaN,NaT,NaN,NaN,0,NaN
1048573,NaT,NaN,NaN,NaT,NaN,NaN,0,NaN
1048574,NaT,NaN,NaN,NaT,NaN,NaN,0,NaN

In [14]:
# Export .csv
trip_16.to_csv(path_or_buf="Resources/Nice_ride_trip_history_2016_season.csv", index=False)